{
  "pt": {
    "pageTitle": "Machine Learning & Ciência Social Computacional - Gabrielly Gomes🧩",
    "langPt": "PT",
    "langEn": "EN",
    "heroHi": "Oi, eu sou a Kimi",
    "heroHeadline": "eu programo para <span class=\"highlight\">impactar</span>",
    "heroDescription": "Sou Engenheira de Dados e Machine Learning, criando soluções inovadoras na interseção da tecnologia, sociedade e acessibilidade",
    "heroCta": "gere impacto",
    "cvTitle": "Currículo",
    "cvExperienceTitle": "EXPERIÊNCIA",
    "cvExp1Title": "Assistente de Engenharia de Dados",
    "cvExp1Company": "Cortex Intelligence Tecnologia",
    "cvExp1DateEn": "(Fevereiro 2025 - Presente)",
    "cvExp1Desc1": "Impulsiono a inovação orientada por dados na equipe de Relações Públicas (PR) da Cortex, transformando dados brutos em insights estratégicos que aprimoram a reputação da marca e o engajamento dos stakeholders.",
    "cvExp1Desc2": "Desenvolvi pipelines automatizados de coleta de dados reduzindo o tempo de coleta manual de dados em <strong>70%</strong>.",
    "cvExp1Desc3": "Desenvolvi e implementei o algoritmo de segmentação automatizada de palavras de entidades utilizando técnicas avançadas de Trie para padronizar e limpar os dados, reduzindo a limpeza manual em <strong>90%</strong> e automazatizando a atualização de dados.",
    "cvExp1Desc4": "Colaborei com a equipe de Ciência de Dados para construir um sistema de validação de entidades com IA, utilizando a API do GPT para garantir a confiabilidade dos dados.",
    "cvExp1Desc5": "Desenvolvi e implementei o algoritimo de geocodificação de entidades, garantindo que <strong>40%</strong> as entidades fossem geocodificadas corretamente, melhorando a precisão dos dados de localização.",
    "cvExp1Desc6": "<a href=\"#portfolio\" class=\"cv-project-link\">Veja mais detalhes abaixo ↓</a>",
    "cvExp1ferramentas": "<strong>Ferramentas e Linguagens:</strong> Databricks, AWS, Postman, Python, Spark, SQL, SQLSpark, Pandas, NumPy, Jupyter Notebook",
    "cvExp2Title": "Pesquisadora de Aprendizado de Máquina",
    "cvExp2Company": "Universidade Federal do Piauí (UFPI)",
    "cvExp2DateEn": "(Setembro 2024 - Abril 2025)",
    "cvExp2Desc1": "Liderei, projetei e desenvolvi a CurupiraIA, um modelo de Aprendizado de Máquina para detecção de discurso de ódio em Português nos comentários de redes sociais.",
    "cvExp2Desc2": "Utilizei a arquitetura BERTimbau para treinamento do modelo, trabalhando com um dataset de 43.6668 comentários classificados.",
    "cvExp2Desc3": "Para lidar com desbalancemanto entre classes, implementei ténicas de dropout no treinamento e otimizei o processo com taxa de aprendizado de 2e-5 e batch size de 32.",
    "cvExp2Desc4": "O modelo alcançou uma acurácia de 81,68% superando a classe majoritária em 10,42%. Resultados de F1-macro e F1-micro foram balanceados entre 61% a 64%",
    "cvExp2Desc5": "O modelo atingiu 89% de precisão para classe Agressive-Hate e 92% de precisão para classe Non-Agressive e demonstrou uma alta eficiência processando 72,36 amostras por segundo.",
    "cvExp2Desc6": "<a href=\"#portfolio\" class=\"cv-project-link\">Veja mais detalhes abaixo ↓</a>",
    "cvExp2ferramentas": "<strong>Ferramentas e Linguagens:</strong> Python, Jupyter Notebook, Transformers",
    "cvEducationTitle": "EDUCAÇÃO",
    "cvEdu1Title": "Universidade Federal do Piauí (UFPI), Teresina, Brasil",
    "cvEdu1Degree": "Bacharelado de Tecnologia em Gestão de Dados. IRA: 9.4/10",
    "cvEdu1Date": "Previsão de Conclusão: Julho de 2028",
    "cvEdu1Detalhes1": "Desenvolvi <strong>atividades práticas</strong> como Pesquisadora Científica de Aprendizado de Máquina, entregando um modelo pré-estruturado e o desenvolvimento de um Resumo Expandido de Pesquisa (REP).",
    "cvEdu1Detalhes2": "<strong>Classificada em 45º lugar</strong>, entre 676 submissões, no 1º Desafio de Inovação em IA Agents (2025) pelo artigo técnico sobre IA para acessibilidade audiovisual, publicado na revista Ready Tensor Inc..",
    "cvEdu1Detalhes3": "<strong>Selecionada entre os 20 melhores</strong> trabalhos, de mais de 50, na ENUCOMPI 2025, onde <strong>apresentei e publiquei</strong> um artigo cientifico sobre as lacunas de água potável no Nordeste orientada por dados.",
    "cvEdu1Detalhes4": "Desenvolvi e ministrei um curso de extensão 20 horas sobre o uso de Dados e IA para impacto social, <strong>capacitando mais de 60 alunos</strong>.",
    "cvEdu1Courses": "<strong>Disciplinas Relevantes:</strong> Machine Learning, Análise de Dados, Estatística Descritiva, Matemática e Lógica, Inteligência Artificial, Estruturas de Dados, Bancos de Dados, Big Data, Programação em Python",
    "cvEduCourseStanfordTitle": "Universidade de Stanford, Code In Place, Stanford, EUA",
    "cvEduCourseStanfordDate": "Programação em Python",
    "cvEduCourseStanfordPeriod": "Período: Maio 2025 - Julho 2025",
    "cvEduCourseStanfordCourses": "<strong>Disciplinas Relevantes:</strong> Lógica de Programação, Python",
    "cvEduCourseStanfordLinkText": "Atividades desenvolvidas",
    "cvEduCourseOracleTitle": "Oracle Next Education, ONE, São Paulo, Brasil",
    "cvEduCourseOracleDate": "Ciência de Dados",
    "cvEduCourseOraclePeriod": "Período: Jan 2025 - Dez 2025",
    "cvEduCourseOracleCourses": "<strong>Disciplinas Relevantes:</strong> Lógica de Programação, Python, Modelagem de Dados, ETL, NumPy, Pandas, Data Visualization, IA para Data Science, Estatística, Machine Learning",
    "cvEduCourseOracleLinkText": "Challenge 1: Alura Store",
    "cvEduCourseOracleLinkText1": "Certificados",
    "cvEduCourseAluraTitle": "Alura, São Paulo, Brasil",
    "cvEduCourseAluraDate": "Engenharia de Dados",
    "cvEduCourseAluraPeriod": "Período: Abr 2025 - Set 2025",
    "cvEduCourseAluraCourses": "<strong>Disciplinas Relevantes:</strong> Databricks, Pipelines, Data Lake, Data Warehouse, Spark, Orientação a Objetos, Engenharia de Dados, Análise de Dados",
    "cvEduCourseAluraLinkText": "Certificados",
    "cvPublicationsTitlePt": "PUBLICAÇÕES",
    "cvPub1": "ALVES GOMES, GABRIELLY (2025). Ready Tensor, Inc. <strong>O Uso da Inteligência Artificial para Acessibilidade Educacional e Cultural no Audiovisual Brasileiro.</strong>",
    "cvPubReadMorePt": "Ler artigo",
    "cvPub2": "ALVES GOMES, GABRIELLY; SIRQUEIRA, VINICIUS CALISTO DE (2025). ENUCOMPI 2025. <strong>Expondo Lacunas Hídricas e Riscos à Saúde no Nordeste Brasileiro Através de Dados</strong>",
    "cvPubReadMorePt2": "Ler artigo",
    "cvVolunteerWorkTitlePt": "TRABALHO VOLUNTÁRIO",
    "cvLeadershipProgramsTitlePt": "PROGRAMAS DE LIDERANÇA",
    "cvProgram1Title": "Representante da Juventude",
    "cvProgram1Org": "Nações Unidas - Conselho Econômico e Social",
    "cvProgram1Date": "Abril 2025",
    "cvProgram1Desc1": "Participação no evento preparatório global para o Fórum da Juventude do ECOSOC, focado no engajamento de jovens na formulação de políticas públicas e contribuição para relatórios internacionais.",
    "cvProgram1Desc2": "Submissão de propostas para integrar perspectivas da juventude no Documento Setorial da Infância e Juventude do HLPF e no Relatório Vozes da Juventude, enfatizando abordagens inclusivas e interseccionais.",
    "cvProgram1Desc3": "Participação ativa em debates sobre tecnologias emergentes e seu papel na formação de um futuro sustentável, incluindo discussões sobre IA ética, inclusão digital e soluções tecnológicas para os ODS.",
    "cvProgram1Desc4": "Engajamento em discussões com especialistas da ONU, representantes governamentais e líderes juvenis globais para acelerar a implementação dos Objetivos de Desenvolvimento Sustentável (ODS) até 2030.",
    "cvProgram2Title": "Líder Aspire",
    "cvProgram2Org": "Instituto Aspire de Harvard",
    "cvProgram2Date": "Março 2025 - Presente",
    "cvProgram2Desc1": "Realizei uma avaliação de liderança personalizada para identificar principais pontos fortes e áreas de crescimento.",
    "cvProgram2Desc2": "Utilizei frameworks da Harvard Business School (HBS) para otimizar a marca no LinkedIn, design de currículo e estratégias de entrevista/networking.",
    "cvProgram2Desc3": "Autoconsciência na liderança e tomada de decisão contextual.",
    "cvProgram2Desc4": "Transformação digital, impacto social da IA e estratégias para resolver desafios comunitários globais.",
    "cvProgram2Desc5": "Construção de confiança e design de soluções escaláveis para questões locais/globais.",
    "cvProgram2Desc6": "Participei de sessões ao vivo com educadores de renome mundial e líderes da indústria.",
    "cvProgram2Desc7": "Colaborei com colegas de mais de 100 países em discussões síncronas, fomentando uma perspectiva global sobre liderança e resolução de problemas inclusiva.",
    "cvProgram3Title": "Jovem Líder",
    "cvProgram3Org": "Your Big Year",
    "cvProgram3Date": "Março 2025 - Junho 2025",
    "cvProgram3Desc0": "<strong>Eleita uma Jovem Líder de destaque.</strong>",
    "cvProgram3Desc1": "Currículo Interativo: Desenvolvendo confiança, pensamento inovador, competência cultural, autoconfiança e resiliência.",
    "cvProgram3Desc2": "Mentoria e Coaching da Indústria: Aprendendo com profissionais e obtendo insights sobre aplicações no mundo real.",
    "cvProgram3Desc3": "Colaboração entre Pares: Engajando com uma rede global de jovens líderes.",
    "cvProgram3Desc4": "Objetivos de Desenvolvimento Sustentável da ONU (ODS): Explorando maneiras de alinhar habilidades, educação e carreira com soluções orientadas para o impacto.",
    "cvProgram3Desc5": "Desenvolvimento de Plano de Ação: Criando um roteiro estruturado para crescimento profissional e pessoal.",
    "servicesTitle": "O que posso fazer por você",
    "service2Title": "Engenharia de Dados",
    "service2Desc": "Desenvolvo e gerencio pipelines de dados robustos e escaláveis, garantindo a coleta, o processamento e a disponibilização de dados de forma eficiente e confiável para suportar análises e aplicações de machine learning.",
    "service2Cta": "🔧 Vamos construir sua infraestrutura de dados!",
    "service3Title": "Engenharia de Machine Learning",
    "service3Desc": "Projeto, construo e coloco em produção sistemas de Machine Learning de ponta a ponta, cuidando desde a concepção do modelo até o monitoramento e manutenção em ambientes produtivos, garantindo performance e escalabilidade.",
    "service3Cta": "💡 Pronto para levar seus modelos de ML para produção?",
    "service4Title": "Ciência Social Computacional",
    "service4Desc": "Utilizo dados e ferramentas computacionais para compreender estruturas e comportamentos sociais. Com foco em uma visão crítica e social, aplico tecnologias como IA para analisar fenômenos sociais e promover reflexões sobre seu uso e implicações éticas, transformando dados em entendimento da realidade social.",
    "service4Cta": "🌍 Vamos entender e transformar a sociedade com dados?",
    "coursesTitle": "Cursos Ministrados",
    "course1Title": "Comportamentos éticos e sociais: explorando o potencial dos dados e IA",
    "course1SummaryContent": "Este curso explora como dados e Inteligência Artificial podem ser utilizados para analisar fenômenos sociais, promovendo uma reflexão crítica sobre suas implicações éticas. Destinado a estudantes de Gestão de Dados da UFPI e ao público geral, com carga horária de 20h.",
    "course1AudienceLabel": "Público:",
    "course1Audience": "60 pessoas",
    "course1PeriodLabel": "Período:",
    "course1Period": "Maio 2025 - Julho 2025",
    "course1MaterialsTitle": "Material do Curso",
    "course1Meeting1Title": "Rastros Digitais: Diálogos entre Dados, Sociedade e Você (Gabrielly A. Gomes, em breve)",
    "portfolioTitle": "Cases de Sucesso",
    "project1Title": "Automação para Segmentação e Padronização de Entidades",
    "project1ChallengeLabel": "O Desafio",
    "project1ChallengeText": "A análise de dados e atualização de entidades era prejudicada por inconsistências e falta de um padrão nos nomes das entidades, o que exigia um processo de limpeza manual intensivo. Além disso, a validação da autenticidade dessas entidades era um desafio complexo, comprometendo a confiabilidade dos dados para uso estratégico.",
    "project1SolutionLabel": "A Solução",
    "project1SolutionText": "Projetei e implementei um algoritmo de segmentação em <strong>Python, PySpark e SQLSpark</strong>, que utiliza uma estrutura de dados Trie como base, além de criar regras especificas para o desafio garantindo a eficiência da segmentação e padronização das entidades. Além disso, para garantir a veracidade dos resultados, foram elaboradas e aplicadas lógicas que analisam o resultado final em três etapas diferentes, garantindo maior eficiência e confiabilidade.",
    "project1ResultsLabel": "Os Resultados",
    "project1ResultsText": "<strong>A solução eliminou 90% do trabalho manual</strong> de limpeza e padronização dos dados. Isso garantiu a automoção completa do processo de atualização de novas entidades e um aumento substancial na confiabilidade e precisão dos dados para todas as análises de Relações Públicas.",
    "project1PraQuem": "<strong>Algoritmo desenvolvido para Cortex Intelligence, enquanto Assistente de Engenharia de Dados.</strong>",
    "project2Title": "Sistema de Validação de Entidades Jornalisticas com IA",
    "project2ChallengeLabel": "O Desafio",
    "project2ChallengeText": "Novas entidades jornalisticas surgiam diariamente e o processo de validação já estava ultrapassado e propenso a erros, o que resultava em uma base de jornalistas desatualizada.",
    "project2SolutionLabel": "A Solução",
    "project2SolutionText": "Em colaboração com a equipe de Ciência de Dados, criei um sistema que primeiro classificava entidades como 'Novas' ou 'Existentes' usando Spark. Para as 'Novas', utilizei a API da OPENAI para realizar uma verificação de validade externa, confirmando e enriquecendo os registros.",
    "project2ResultsLabel": "Os Resultados",
    "project2ResultsText": "Criação de uma fonte de dados confiável e sempre atualizada, automação completa do processo de pesquisa e validação, e melhora na eficiência das campanhas de Relações Públicas.",
    "project2PraQuem": "<strong>Desenvolvido para Cortex Intelligence, enquanto Assistente de Engenharia de Dados.</strong>",
    "project3Title": "Algoritmo de Geocodificação de Entedidades",
    "project3ChallengeLabel": "O Desafio",
    "project3ChallengeText": "A geocodificação de entidades era feita manualmente, o que resultava em erros frequentes, inconsistências dos dados e ausência de informações geográficas essenciais para a equipe de Relações Públicas.",
    "project3SolutionLabel": "A Solução",
    "project3SolutionText": "Desenvolvi e implementei um algoritmo de geocodificação customizada, através da ferramenta GeoPy, que processa os nomes das entidades e retorna sua localização a nível de cidade, estado e país. O algoritimo foi projetado para encontrar a localização mais precisa e atualizar automaticamente a entidade no banco de dados.",
    "project3ResultsLabel": "Os Resultados",
    "project3ResultsText": "O algoritmo alcançou uma taxa de acerto de 40%na geocodificação das entidades, garantindo o preenchimento correto e completo de grande parte das entidades e melhorando a precisão dos dados de localização, eliminando erros manuais. Além disso, a automação do processo de geocodificação reduziu significativamente o tempo gasto pela equipe de Relações Públicas na atualização de dados geográficos.",
    "project3PraQuem": "<strong>Desenvolvido para Cortex Intelligence, enquanto Assistente de Engenharia de Dados.</strong>",
    "contactTitle": "Me fale sobre o seu projeto",
    "contactDesc1": "Todo projeto tem um problema a ser resolvido. Se você tem um desafio, eu posso programar a solução.",
    "contactDesc2": "Após você entrar em contato, responderei em 2-3 dias úteis com uma estimativa inicial do projeto ou perguntas de acompanhamento para entender melhor suas necessidades.",
    "contactButton": "Entre em contato",
    "connectWithMe": "bora conectar",
    "emailContact": "Email",
    "copyright": "&copy; Criado com 💻 e ☕ por: CodeOnTheSpectrum | 2025"
  },
  "en": {
    "pageTitle": "Machine Learning & Computational Social Science - Gabrielly Gomes 🧩",
    "langPt": "PT",
    "langEn": "EN",
    "heroHi": "Hi, call me Kimi",
    "heroHeadline": "I code to <span class=\"highlight\">impact</span>",
    "heroDescription": "I'm a Data and Machine Learning engineer, crafting innovative solutions at the intersection of technology, society, and accessibility",
    "heroCta": "make impact",
    "cvTitle": "Resume",
    "cvExperienceTitle": "EXPERIENCE",
    "cvExp1Title": "Data Engineering Assistant",
    "cvExp1Company": "Cortex Intelligence",
    "cvExp1DateEn": "(February 2025 - Present)",
    "cvExp1Desc1": "I drive data-driven innovation in Cortex's Public Relations (PR) team, transforming raw data into strategic insights that enhance brand reputation and stakeholder engagement.",
    "cvExp1Desc2": "Developed automated data collection pipelines, reducing manual data collection time by <strong>70%</strong>.",
    "cvExp1Desc3": "Developed and implemented the automated entity word segmentation algorithm using advanced Trie techniques to standardize and clean data, reducing manual cleaning by <strong>90%</strong> and automating data updates.",
    "cvExp1Desc4": "Collaborated with the Data Science team to build an AI-powered entity validation system, using the GPT API to ensure data reliability.",
    "cvExp1Desc5": "Developed and implemented the entity geocoding algorithm, ensuring that <strong>40%</strong> of entities were correctly geocoded, improving the accuracy of location data.",
    "cvExp1Desc6": "<a href=\"#portfolio\" class=\"cv-project-link\">See more details below ↓</a>",
    "cvExp1ferramentas": "<strong>Tools and Languages:</strong> Databricks, AWS, Postman, Python, Spark, SQL, SQLSpark, Pandas, NumPy, Jupyter Notebook",
    "cvExp2Title": "Machine Learning Researcher",
    "cvExp2Company": "Federal University of Piauí (UFPI)",
    "cvExp2DateEn": "(September 2024 - April 2025)",
    "cvExp2Desc1": "Led, designed, and developed CurupiraIA, a Machine Learning model for detecting hate speech in Portuguese in social media comments.",
    "cvExp2Desc2": "Used the BERTimbau architecture for model training, working with a dataset of 43,668 classified comments.",
    "cvExp2Desc3": "To handle class imbalance, I implemented dropout techniques in training and optimized the process with a learning rate of 2e-5 and a batch size of 32.",
    "cvExp2Desc4": "The model achieved an accuracy of 81.68%, outperforming the majority class by 10.42%. F1-macro and F1-micro results were balanced, ranging from 61% to 64%.",
    "cvExp2Desc5": "The model reached 89% precision for the Aggressive-Hate class and 92% precision for the Non-Aggressive class, and demonstrated high efficiency by processing 72.36 samples per second.",
    "cvExp2Desc6": "<a href=\"#portfolio\" class=\"cv-project-link\">See more details below ↓</a>",
    "cvExp2ferramentas": "<strong>Tools and Languages:</strong> Python, Jupyter Notebook, Transformers",
    "cvEducationTitle": "EDUCATION",
    "cvEdu1Title": "Federal University of Piauí (UFPI), Teresina, Brazil",
    "cvEdu1Degree": "Bachelor of Technology in Data Management. GPA: 9.4/10",
    "cvEdu1Date": "Expected Graduation: July 2028",
    "cvEdu1Detalhes1": "Developed <strong>practical activities</strong> as a Machine Learning Scientific Researcher, delivering a pre-structured model and developing a Research Summary Paper (REP).",
    "cvEdu1Detalhes2": "<strong>Ranked 45th</strong>, among 676 submissions, in the 1st Agentic AI Innovation Challenge (2025) for a technical paper on AI for audiovisual accessibility, published in Ready Tensor Inc. magazine.",
    "cvEdu1Detalhes3": "<strong>Selected among the top 20</strong> papers, out of more than 50, at ENUCOMPI 2025, where I <strong>presented and published</strong> a scientific paper on data-driven analysis of drinking water gaps in Northeast Brazil.",
    "cvEdu1Detalhes4": "Developed and taught a 20-hour extension course on the use of Data and AI for social impact, <strong>training over 60 students</strong>.",
    "cvEdu1Courses": "<strong>Relevant Coursework:</strong> Machine Learning, Data Analysis, Descriptive Statistics, Mathematics and Logic, Artificial Intelligence, Data Structures, Databases, Big Data, Python Programming",
    "cvEduCourseStanfordTitle": "Stanford University, Code In Place, Stanford, USA",
    "cvEduCourseStanfordDate": "Computer Programming",
    "cvEduCourseStanfordPeriod": "Period: May 2025 - July 2025",
    "cvEduCourseStanfordCourses": "<strong>Relevant Coursework:</strong> Programming Logic, Python",
    "cvEduCourseStanfordLinkText": "Developed activities",
    "cvEduCourseOracleTitle": "Oracle Next Education, ONE, São Paulo, Brazil",
    "cvEduCourseOracleDate": "Data Science",
    "cvEduCourseOraclePeriod": "Period: Jan 2025 - Dec 2025",
    "cvEduCourseOracleCourses": "<strong>Relevant Coursework:</strong> Programming Logic, Python, Data Modeling, ETL, NumPy, Pandas, Data Visualization, AI for Data Science, Statistics, Machine Learning",
    "cvEduCourseOracleLinkText": "Challenge 1: Alura Store",
    "cvEduCourseOracleLinkText1": "Certificates",
    "cvEduCourseAluraTitle": "Alura, São Paulo, Brazil",
    "cvEduCourseAluraDate": "Data Engineering",
    "cvEduCourseAluraPeriod": "Period: Apr 2025 - Sep 2025",
    "cvEduCourseAluraCourses": "<strong>Relevant Coursework:</strong> Databricks, Pipelines, Data Lake, Data Warehouse, Spark, Object-Oriented Programming, Data Engineering, Data Analysis",
    "cvEduCourseAluraLinkText": "Certificates",
    "cvPublicationsTitleEn": "PUBLICATIONS",
    "cvPub1": "ALVES GOMES, GABRIELLY (2025). Ready Tensor, Inc. <strong>The Use of Artificial Intelligence for Educational and Cultural Accessibility in Brazilian Audiovisual.</strong>",
    "cvPubReadMoreEn": "Read article",
    "cvPub2": "ALVES GOMES, GABRIELLY; SIRQUEIRA, VINICIUS CALISTO DE (2025). ENUCOMPI 2025. <strong>Exposing Water Gaps and Health Risks in Northeast Brazil Through Data.</strong>",
    "cvPubReadMoreEn2": "Read article",
    "cvVolunteerWorkTitleEn": "VOLUNTEER WORK",
    "cvLeadershipProgramsTitleEn": "LEADERSHIP PROGRAMS",
    "cvProgram1Title": "Youth Representative",
    "cvProgram1Org": "United Nations - Economic and Social Council",
    "cvProgram1Date": "April 2025",
    "cvProgram1Desc1": "Participation in the global preparatory event for the ECOSOC Youth Forum, focused on engaging youth in shaping public policies and contributing to international reports.",
    "cvProgram1Desc2": "Submission of proposals to integrate youth perspectives into the HLPF Children and Youth Sectoral Paper and the Voices of Youth Report, emphasizing inclusive and intersectional approaches.",
    "cvProgram1Desc3": "Active participation in debates on emerging technologies and their role in shaping a sustainable future, including discussions on ethical AI, digital inclusion, and tech-driven solutions for the SDGs.",
    "cvProgram1Desc4": "Engaged in discussions with UN experts, government representatives, and global youth leaders to strategize accelerating the implementation of the Sustainable Development Goals (SDGs) by 2030.",
    "cvProgram2Title": "Aspire Leader",
    "cvProgram2Org": "Harvard's Aspire Institute",
    "cvProgram2Date": "March 2025 - Present",
    "cvProgram2Desc1": "Conducted a personalized leadership assessment to identify core strengths and growth areas.",
    "cvProgram2Desc2": "Leveraged Harvard Business School (HBS) frameworks to optimize LinkedIn branding, resume design, and interview/networking strategies.",
    "cvProgram2Desc3": "Self-awareness in leadership & contextual decision-making.",
    "cvProgram2Desc4": "Digital transformation, AI's societal impact, and strategies for solving global community challenges.",
    "cvProgram2Desc5": "Trust-building and designing scalable solutions for local/global issues.",
    "cvProgram2Desc6": "Engaged in live sessions with world-renowned educators and industry leaders.",
    "cvProgram2Desc7": "Collaborated with peers from 100+ countries in synchronous discussions, fostering a global perspective on leadership and inclusive problem-solving.",
    "cvProgram3Title": "Young Leader",
    "cvProgram3Org": "Your Big Year",
    "cvProgram3Date": "March 2025 - June 2025",
    "cvProgram3Desc0": "<strong>Elected a featured Young Leader.</strong>",
    "cvProgram3Desc1": "Interactive Curriculum: Developing confidence, innovative thinking, cultural competency, self-reliance, and resiliency.",
    "cvProgram3Desc2": "Industry Mentorship & Coaching: Learning from professionals and gaining insights into real-world applications.",
    "cvProgram3Desc3": "Peer Collaboration: Engaging with a global network of young leaders.",
    "cvProgram3Desc4": "UN Sustainable Development Goals (SDGs): Exploring ways to align skills, education, and career with impact-driven solutions.",
    "cvProgram3Desc5": "Action Plan Development: Creating a structured roadmap for professional and personal growth.",
    "servicesTitle": "What I can do for you",
    "service2Title": "Data Engineering",
    "service2Desc": "I develop and manage robust and scalable data pipelines, ensuring efficient and reliable data collection, processing, and availability to support analytics and machine learning applications.",
    "service2Cta": "🔧 Let's build your data infrastructure!",
    "service3Title": "Machine Learning Engineering",
    "service3Desc": "I design, build, and deploy end-to-end Machine Learning systems, handling everything from model conception to monitoring and maintenance in production environments, ensuring performance and scalability.",
    "service3Cta": "💡 Ready to take your ML models to production?",
    "service4Title": "Computational Social Science",
    "service4Desc": "I use data and computational tools to understand social structures and behaviors. Focusing on a critical and social perspective, I apply technologies like AI to analyze social phenomena and promote reflections on their use and ethical implications, transforming data into an understanding of social reality.",
    "service4Cta": "🌍 Let's understand and transform society with data?",
    "coursesTitle": "Taught Courses",
    "course1Title": "Ethical and social behaviors: exploring the potential of data and AI",
    "course1SummaryContent": "This course explores how data and Artificial Intelligence can be used to analyze social phenomena, promoting critical reflection on their ethical implications. Aimed at Data Management students at UFPI and the general public, with a workload of 20 hours.",
    "course1AudienceLabel": "Audience:",
    "course1Audience": "60 people",
    "course1PeriodLabel": "Period:",
    "course1Period": "May 2025 - July 2025",
    "course1MaterialsTitle": "Course Material",
    "course1Meeting1Title": "Digital Traces: Dialogues between Data, Society and You (Gabrielly A. Gomes, coming soon)",
    "portfolioTitleEn": "Success Cases",
    "project1TitleEn": "Automation for Entity Segmentation and Standardization",
    "project1ChallengeLabelEn": "The Challenge",
    "project1ChallengeTextEn": "Data analysis and entity updates were hampered by inconsistencies and the lack of a standard in entity names, which required an intensive manual cleaning process. Furthermore, validating the authenticity of these entities was a complex challenge, compromising the reliability of the data for strategic use.",
    "project1SolutionLabelEn": "The Solution",
    "project1SolutionTextEn": "I designed and implemented a segmentation algorithm in <strong>Python, PySpark, and SQLSpark</strong>, which uses a Trie data structure as a base, along with creating specific rules for the challenge, ensuring the efficiency of entity segmentation and standardization. Additionally, to ensure the veracity of the results, logic was developed and applied to analyze the final result in three different stages, guaranteeing greater efficiency and reliability.",
    "project1ResultsLabelEn": "The Results",
    "project1ResultsTextEn": "<strong>The solution eliminated 90% of the manual work</strong> of data cleaning and standardization. This ensured the complete automation of the process of updating new entities and a substantial increase in the reliability and accuracy of the data for all Public Relations analyses.",
    "project1PraQuemEn": "<strong>Algorithm developed for Cortex Intelligence, as a Data Engineering Assistant.</strong>",
    "project2TitleEn": "AI-Powered Journalistic Entity Validation System",
    "project2ChallengeLabelEn": "The Challenge",
    "project2ChallengeTextEn": "New journalistic entities emerged daily, and the validation process was outdated and prone to errors, resulting in an outdated journalist database.",
    "project2SolutionLabelEn": "The Solution",
    "project2SolutionTextEn": "In collaboration with the Data Science team, I created a system that first classified entities as 'New' or 'Existing' using Spark. For the 'New' ones, I used the OPENAI API to perform an external validity check, confirming and enriching the records.",
    "project2ResultsLabelEn": "The Results",
    "project2ResultsTextEn": "Creation of a reliable and always-updated data source, complete automation of the research and validation process, and improvement in the efficiency of Public Relations campaigns.",
    "project2PraQuemEn": "<strong>Developed for Cortex Intelligence, as a Data Engineering Assistant.</strong>",
    "project3TitleEn": "Entity Geocoding Algorithm",
    "project3ChallengeLabelEn": "The Challenge",
    "project3ChallengeTextEn": "The geocoding of entities was done manually, which resulted in frequent errors, data inconsistencies, and the absence of essential geographical information for the Public Relations team.",
    "project3SolutionLabelEn": "The Solution",
    "project3SolutionTextEn": "I developed and implemented a custom geocoding algorithm, using the GeoPy tool, which processes entity names and returns their location at the city, state, and country level. The algorithm was designed to find the most accurate location and automatically update the entity in the database.",
    "project3ResultsLabelEn": "The Results",
    "project3ResultsTextEn": "The algorithm achieved a 40% success rate in geocoding entities, ensuring the correct and complete filling of a large part of the entities and improving the accuracy of location data, eliminating manual errors. Furthermore, the automation of the geocoding process significantly reduced the time spent by the Public Relations team on updating geographic data.",
    "project3PraQuemEn": "<strong>Developed for Cortex Intelligence, as a Data Engineering Assistant.</strong>",
    "contactTitle": "Tell me about your project",
    "contactDesc1": "Every project has a problem to solve. If you have a challenge, I can code the solution.",
    "contactDesc2": "After you reach out, I’ll respond within 2-3 business days with either an initial project estimate or follow-up questions to understand your needs better.",
    "contactButton": "Get in touch",
    "connectWithMe": "let's connect",
    "emailContact": "Email",
    "copyright": "&copy; Created with 💻 and ☕ by: CodeOnTheSpectrum | 2025"
  }
}