{
  "pt": {
    "pageTitle": "Machine Learning & Ciência Social Computacional - Gabrielly Gomes🧩",
    "langPt": "PT",
    "langEn": "EN",
    "heroHi": "Oi, eu sou a Kimi",
    "heroHeadline": "eu programo para <span class=\"highlight\">impactar</span>",
    "heroDescription": "Sou engenheira de Dados e Machine Learning, criando soluções inovadoras na interseção da tecnologia, sociedade e acessibilidade",
    "heroCta": "gere impacto",
    "cvTitle": "Currículo",
    "cvName": "GABRIELLY A. GOMES",
    "cvRoleLocation": "Engenheira de Dados e Pesquisadora de Machine Learning<br>Natal, RN, Brasil",
    "cvContactLinks": "gabrielly.gomes@ufpi.edu.br | linkedin.com/in/gabrielly-gomes-ml",
    "cvExperienceTitle": "EXPERIÊNCIA",
    "cvExp1Title": "Assistente de Engenharia de Dados",
    "cvExp1Company": "Cortex Intelligence (Fevereiro 2025 - Presente)",
    "cvExp1Desc1": "Automatizei fluxos de trabalho da equipe de RP usando Python e Spark no Databricks, reduzindo o tempo de processamento de semanas para horas.",
    "cvExp1Desc2": "Colaborei com engenheiros para desenvolver e aprimorar serviços de Relações Públicas (RP), incluindo pipelines ETL e processos de dados.",
    "cvExp1Desc3": "Utilizei serviços AWS (ECS, SQS, S3) e Databricks para soluções de dados escaláveis.",
    "cvExp2Title": "Pesquisadora de Machine Learning",
    "cvExp2Company": "Universidade Federal do Piauí (UFPI) (Setembro 2024 - Abril 2025)",
    "cvExp2Desc1": "Projetei e desenvolvi um modelo de ML para detectar discurso de ódio em português nas redes sociais, alcançando 75-80% de precisão.",
    "cvEducationTitle": "EDUCAÇÃO",
    "cvEdu1Title": "Universidade Federal do Piauí (UFPI), Teresina, Brasil",
    "cvEdu1Degree": "Tecnologia em Gestão de Dados | Conclusão Prevista: 2028 | GPA: 9.4/10",
    "cvEdu1Courses": "<strong>Cursos Relevantes:</strong> Machine Learning, Análise de Dados, Estatística Descritiva, Matemática e Lógica, Inteligência Artificial, Estruturas de Dados, Bancos de Dados, Big Data",
    "cvSkillsTitle": "HABILIDADES TÉCNICAS",
    "cvSkillCat1": "<strong>Programação/Scripting:</strong> Python, SQL, R",
    "cvSkillCat2": "<strong>Ferramentas:</strong> PyTorch, Git, Spark, Scikit-learn, AWS (ECS, SQS, S3), Databricks, NumPy, Pandas, FastAPI, Flask, Jupyter Notebook, VSCode",
    "cvSkillCat3": "<strong>Cloud:</strong> AWS (ECS, SQS, S3), Databricks",
    "cvCoursesTitle": "CURSOS RELEVANTES",
    "cvCourse1": "<strong>Ciência de Dados:</strong> Algoritmos e Estruturas de Dados, Análise de Dados, Excel, Machine Learning, Processamento de Linguagem Natural (PNL), IA Generativa",
    "cvCourse2": "<strong>Programação:</strong> Code in Place (Stanford University, 2025 - Python)",
    "cvCourse3": "<strong>Programa de Ciência de Dados:</strong> (One Oracle Next Education, Jan 2025 - Dez 2025 - Cursando)",
    "cvCourse4": "<strong>Trilha de Engenharia de Dados:</strong> (Alura)",
    "cvCourse5": "<strong>Matemática:</strong> Álgebra Linear, Estatística, Probabilidade",
    "cvCourse6": "<strong>Negócios:</strong> Dados para Comércio, Dados para Saúde",
    "cvCourse7": "<strong>Idiomas:</strong> Português (C2), Inglês (C2), Espanhol (B1), Francês (A2)",
    "cvPublicationsTitle": "PUBLICAÇÕES",
    "cvPub1": "ALVES GOMES, GABRIELLY. Ready Tensor, Inc. O Uso da Inteligência Artificial para Acessibilidade Educacional e Cultural no Audiovisual Brasileiro. Publicado para o 1º Desafio de Inovação em IA Agêntica (2025).",
    "cvPubLink1": "#",
    "cvProgramsTitle": "PROGRAMAS E TRABALHO VOLUNTÁRIO",
    "cvProgram1Title": "Representante da Juventude",
    "cvProgram1Org": "Nações Unidas - Conselho Econômico e Social",
    "cvProgram1Date": "Abril 2025",
    "cvProgram1Desc1": "Participação no evento preparatório global para o Fórum da Juventude do ECOSOC, focado no engajamento de jovens na formulação de políticas públicas e contribuição para relatórios internacionais.",
    "cvProgram1Desc2": "Submissão de propostas para integrar perspectivas da juventude no Documento Setorial da Infância e Juventude do HLPF e no Relatório Vozes da Juventude, enfatizando abordagens inclusivas e interseccionais.",
    "cvProgram1Desc3": "Participação ativa em debates sobre tecnologias emergentes e seu papel na formação de um futuro sustentável, incluindo discussões sobre IA ética, inclusão digital e soluções tecnológicas para os ODS.",
    "cvProgram1Desc4": "Engajamento em discussões com especialistas da ONU, representantes governamentais e líderes juvenis globais para acelerar a implementação dos Objetivos de Desenvolvimento Sustentável (ODS) até 2030.",
    "cvProgram2Title": "Líder Aspire",
    "cvProgram2Org": "Instituto Aspire de Harvard",
    "cvProgram2Date": "Março 2025 - Presente",
    "cvProgram2Desc1": "Realizei uma avaliação de liderança personalizada para identificar principais pontos fortes e áreas de crescimento.",
    "cvProgram2Desc2": "Utilizei frameworks da Harvard Business School (HBS) para otimizar a marca no LinkedIn, design de currículo e estratégias de entrevista/networking.",
    "cvProgram2Desc3": "Autoconsciência na liderança e tomada de decisão contextual.",
    "cvProgram2Desc4": "Transformação digital, impacto social da IA e estratégias para resolver desafios comunitários globais.",
    "cvProgram2Desc5": "Construção de confiança e design de soluções escaláveis para questões locais/globais.",
    "cvProgram2Desc6": "Participei de sessões ao vivo com educadores de renome mundial e líderes da indústria.",
    "cvProgram2Desc7": "Colaborei com colegas de mais de 100 países em discussões síncronas, fomentando uma perspectiva global sobre liderança e resolução de problemas inclusiva.",
    "cvProgram3Title": "Jovem Líder",
    "cvProgram3Org": "Your Big Year",
    "cvProgram3Date": "Março 2025 - Presente",
    "cvProgram3Desc1": "Currículo Interativo: Desenvolvendo confiança, pensamento inovador, competência cultural, autoconfiança e resiliência.",
    "cvProgram3Desc2": "Mentoria e Coaching da Indústria: Aprendendo com profissionais e obtendo insights sobre aplicações no mundo real.",
    "cvProgram3Desc3": "Colaboração entre Pares: Engajando com uma rede global de jovens líderes.",
    "cvProgram3Desc4": "Objetivos de Desenvolvimento Sustentável da ONU (ODS): Explorando maneiras de alinhar habilidades, educação e carreira com soluções orientadas para o impacto.",
    "cvProgram3Desc5": "Desenvolvimento de Plano de Ação: Criando um roteiro estruturado para crescimento profissional e pessoal.",
    "coursesTitle": "Cursos Ministrados",
    "course1SummaryTitle": "Resumo do Curso: Comportamentos éticos e sociais: explorando o potencial dos dados e da IA",
    "course1SummaryContent": "Este curso explora como dados e Inteligência Artificial podem ser utilizados para analisar fenômenos sociais, promovendo uma reflexão crítica sobre suas implicações éticas. Destinado a estudantes de Gestão de Dados da UFPI e ao público geral, com carga horária de 20h.",
    "course1SummaryAudience": "Público: 60 pessoas",
    "course1SummaryPeriod": "Período: Maio 2025 - Junho 2025",
    "course1MaterialsTitle": "Materiais do Curso",
    "course1Meeting1Title": "Aula 1 – O que é Ciências Sociais Computacionais?",
    "course1Meeting2Title": "Aula 2 – Redes Sociais e Estrutura das Relações Humanas",
    "course1Meeting3Title": "Aula 3 – Big Data, IA e Ética",
    "course1Meeting4Title": "Aula 4 – Simulações e Padrões Sociais",
    "course1Meeting5Title": "Aula 5 – O que os dados sociais dizem sobre o mundo?",
    "course1Meeting6Title": "Aula 6 - Como eu sou lido por algoritmos?",
    "servicesTitle": "O que posso fazer por você",
    "service1Title": "Desenvolvimento Machine Learning",
    "service1Desc": "Sou especialista em desenvolver soluções de machine learning que transformam dados brutos em insights acionáveis. Se você precisa de modelos preditivos, sistemas de recomendação ou automação, posso ajudar a projetar, treinar e otimizar modelos de ML adaptados às suas necessidades.",
    "service1Cta": "🚀 Vamos construir algo inteligente juntos.",
    "service2Title": "Engenharia de Dados",
    "service2Desc": "Desenvolvo e gerencio pipelines de dados robustos e escaláveis, garantindo a coleta, o processamento e a disponibilização de dados de forma eficiente e confiável para suportar análises e aplicações de machine learning.",
    "service2Cta": "🔧 Vamos construir sua infraestrutura de dados!",
    "service3Title": "Engenharia de Machine Learning",
    "service3Desc": "Projeto, construo e coloco em produção sistemas de Machine Learning de ponta a ponta, cuidando desde a concepção do modelo até o monitoramento e manutenção em ambientes produtivos, garantindo performance e escalabilidade.",
    "service3Cta": "💡 Pronto para levar seus modelos de ML para produção?",
    "service4Title": "Ciência Social Computacional",
    "service4Desc": "Utilizo dados e ferramentas computacionais para compreender estruturas e comportamentos sociais. Com foco em uma visão crítica e social, aplico tecnologias como IA para analisar fenômenos sociais e promover reflexões sobre seu uso e implicações éticas, transformando dados em entendimento da realidade social.",
    "service4Cta": "🌍 Vamos entender e transformar a sociedade com dados?",
    "servicesCta": "Vamos conversar",
    "testimonialsTitle": "“Kim combina empatia e excelência técnica através de código e dados para resolver problemas e enfrentar desafios complexos com soluções inovadoras.”",
    "testimonial1Quote": "\"Pudemos compartilhar vários projetos e ótimas experiências. Admiro sua capacidade analítica, entusiasmo e dedicação.\"",
    "testimonial1Name": "Gica Alves",
    "testimonial1Role": "Analista de Dados, Itaú Bank",
    "testimonial2Quote": "\"Estou trabalhando com ela há um ano. Entre todos os membros da equipe, ela sempre se destacou como a mais trabalhadora, entregando projetos antes do prazo. Além disso, demonstrou proficiência em áreas de conhecimento avançado, o que contribuiu para elevar a qualidade do projeto final.\"",
    "testimonial2Name": "Iago Aragão",
    "testimonial2Role": "CEO, Galliani Ltda.",
    "testimonial3Quote": "\"Trabalhamos juntas em projetos de IA e Machine Learning, e sempre fiquei impressionada com seu trabalho árduo, curiosidade e capacidade de aprender tudo muito rapidamente. Ela está sempre disposta a procurar soluções criativas, trabalha muito bem em equipe e está sempre aberta a novos desafios. Além disso, ela é super organizada e comprometida! Tenho certeza que ela fará a diferença em qualquer projeto ou equipe de TI!\"",
    "testimonial3Name": "Amanda Medeiros",
    "testimonial3Role": "Pesquisadora de Machine Learning, Universidade Federal do Piauí",
    "portfolioTitle": "Meu Portfólio",
    "contactTitle": "Me fale sobre o seu projeto",
    "contactDesc1": "Todo projeto tem um problema a ser resolvido. Se você tem um desafio, eu posso programar a solução.",
    "contactDesc2": "Após você entrar em contato, responderei em 2-3 dias úteis com uma estimativa inicial do projeto ou perguntas de acompanhamento para entender melhor suas necessidades.",
    "contactButton": "Entre em contato",
    "designBy": "Design por",
    "connectWithMe": "bora conectar",
    "emailContact": "Email",
    "copyright": "&copy; Criado com 💻 e ☕ por: CodeOnTheSpectrum | 2025"
  },
  "en": {
    "pageTitle": "Machine Learning & Computational Social Science - Gabrielly Gomes 🧩",
    "langPt": "PT",
    "langEn": "EN",
    "heroHi": "Hi, call me Kimi",
    "heroHeadline": "I code to <span class=\"highlight\">impact</span>",
    "heroDescription": "I'm a Data and Machine Learning engineer, crafting innovative solutions at the intersection of technology, society, and accessibility",
    "heroCta": "make impact",
    "cvTitle": "Resume",
    "cvName": "GABRIELLY A. GOMES",
    "cvRoleLocation": "Data Engineer and Machine Learning Researcher<br>Natal, RN, Brazil",
    "cvContactLinks": "gabrielly.gomes@ufpi.edu.br | linkedin.com/in/gabrielly-gomes-ml",
    "cvExperienceTitle": "EXPERIENCE",
    "cvExp1Title": "Data Engineering Assistant",
    "cvExp1Company": "Cortex Intelligence (February 2025 - Present)",
    "cvExp1Desc1": "Automated PR team workflows using Python and Spark on Databricks, reducing processing time from weeks to hours.",
    "cvExp1Desc2": "Collaborated with engineers to develop and enhance Public Relations (PR) services, including ETL pipelines and data processes.",
    "cvExp1Desc3": "Utilized AWS services (ECS, SQS, S3) and Databricks for scalable data solutions.",
    "cvExp2Title": "Machine Learning Researcher",
    "cvExp2Company": "Federal University of Piauí (UFPI) (September 2024 - April 2025)",
    "cvExp2Desc1": "Designed and developed an ML model for detecting hate speech in Portuguese on social media, achieving 75-80% accuracy.",
    "cvEducationTitle": "EDUCATION",
    "cvEdu1Title": "Federal University of Piauí (UFPI), Teresina, Brazil",
    "cvEdu1Degree": "Bachelor of Technology in Data Management | Expected Graduation: 2028 | GPA: 9.4/10",
    "cvEdu1Courses": "<strong>Relevant Coursework:</strong> Machine Learning, Data Analysis, Descriptive Statistics, Mathematics and Logic, Artificial Intelligence, Data Structures, Databases, Big Data",
    "cvSkillsTitle": "TECHNICAL SKILLS",
    "cvSkillCat1": "<strong>Programming/Scripting:</strong> Python, SQL, R",
    "cvSkillCat2": "<strong>Tools:</strong> PyTorch, Git, Spark, Scikit-learn, AWS (ECS, SQS, S3), Databricks, NumPy, Pandas, FastAPI, Flask, Jupyter Notebook, VSCode",
    "cvSkillCat3": "<strong>Cloud:</strong> AWS (ECS, SQS, S3), Databricks",
    "cvCoursesTitle": "RELEVANT COURSES",
    "cvCourse1": "<strong>Data Science:</strong> Algorithms & Data Structures, Data Analysis, Excel, Machine Learning, Natural Language Processing (NLP), Generative AI",
    "cvCourse2": "<strong>Programming:</strong> Code in Place (Stanford University, 2025 - Python)",
    "cvCourse3": "<strong>Data Science Program:</strong> (One Oracle Next Education, Jan 2025 - Dec 2025 - Currently Enrolled)",
    "cvCourse4": "<strong>Data Engineering Track:</strong> (Alura)",
    "cvCourse5": "<strong>Mathematics:</strong> Linear Algebra, Statistics, Probability",
    "cvCourse6": "<strong>Business:</strong> Data for Commerce, Data for Healthcare",
    "cvCourse7": "<strong>Languages:</strong> Portuguese (C2), English (C2), Spanish (B1), French (A2)",
    "cvPublicationsTitle": "PUBLICATIONS",
    "cvPub1": "ALVES GOMES, GABRIELLY. Ready Tensor, Inc. The Use of Artificial Intelligence for Educational and Cultural Accessibility in Brazilian Audiovisual. Published for the 1st Agentic AI Innovation Challenge (2025).",
    "cvPubLink1": "#",
    "cvProgramsTitle": "PROGRAMS & VOLUNTEER WORK",
    "cvProgram1Title": "Youth Representative",
    "cvProgram1Org": "United Nations - Economic and Social Council",
    "cvProgram1Date": "April 2025",
    "cvProgram1Desc1": "Participation in the global preparatory event for the ECOSOC Youth Forum, focused on engaging youth - in shaping public policies and contributing to international reports.",
    "cvProgram1Desc2": "Submission of proposals to integrate youth perspectives into the HLPF Children and Youth Sectoral Paper and the Voices of Youth Report, emphasizing inclusive and intersectional approaches.",
    "cvProgram1Desc3": "Active participation in debates on emerging technologies and their role in shaping a sustainable future, including discussions on ethical AI, digital inclusion, and tech-driven solutions for the SDGs.",
    "cvProgram1Desc4": "Engaged in discussions with UN experts, government representatives, and global youth leaders to strategize accelerating the implementation of the Sustainable Development Goals (SDGs) by 2030.",
    "cvProgram2Title": "Aspire Leader",
    "cvProgram2Org": "Harvard's Aspire Institute",
    "cvProgram2Date": "March 2025 - Present",
    "cvProgram2Desc1": "Conducted a personalized leadership assessment to identify core strengths and growth areas.",
    "cvProgram2Desc2": "Leveraged Harvard Business School (HBS) frameworks to optimize LinkedIn branding, resume design, and interview/networking strategies.",
    "cvProgram2Desc3": "Self-awareness in leadership & contextual decision-making.",
    "cvProgram2Desc4": "Digital transformation, AI's societal impact, and strategies for solving global community challenges.",
    "cvProgram2Desc5": "Trust-building and designing scalable solutions for local/global issues.",
    "cvProgram2Desc6": "Engaged in live sessions with world-renowned educators and industry leaders.",
    "cvProgram2Desc7": "Collaborated with peers from 100+ countries in synchronous discussions, fostering a global perspective on leadership and inclusive problem-solving.",
    "cvProgram3Title": "Young Leader",
    "cvProgram3Org": "Your Big Year",
    "cvProgram3Date": "March 2025 - Present",
    "cvProgram3Desc1": "Interactive Curriculum: Developing confidence, innovative thinking, cultural competency, self-reliance, and resiliency.",
    "cvProgram3Desc2": "Industry Mentorship & Coaching: Learning from professionals and gaining insights into real-world applications.",
    "cvProgram3Desc3": "Peer Collaboration: Engaging with a global network of young leaders.",
    "cvProgram3Desc4": "UN Sustainable Development Goals (SDGs): Exploring ways to align skills, education, and career with impact-driven solutions.",
    "cvProgram3Desc5": "Action Plan Development: Creating a structured roadmap for professional and personal growth.",
    "coursesTitle": "Taught Courses",
    "course1SummaryTitle": "Course Summary: Ethical and social behaviors: exploring the potential of data and AI",
    "course1SummaryContent": "This course explores how data and Artificial Intelligence can be used to analyze social phenomena, promoting critical reflection on their ethical implications. Aimed at Data Management students at UFPI and the general public, with a workload of 20 hours.",
    "course1SummaryAudience": "Audience: 60 people",
    "course1SummaryPeriod": "Period: May 2025 - June 2025",
    "course1MaterialsTitle": "Course Materials",
    "course1Meeting1Title": "Lesson 1 – What is Computational Social Sciences?",
    "course1Meeting2Title": "Lesson 2 – Social Networks and the Structure of Human Relations",
    "course1Meeting3Title": "Lesson 3 – Big Data, AI, and Ethics",
    "course1Meeting4Title": "Lesson 4 – Simulations and Social Patterns",
    "course1Meeting5Title": "Lesson 5 – What do social data say about the world?",
    "course1Meeting6Title": "Lesson 6 - How am I read by algorithms?",
    "servicesTitle": "What I can do for you",
    "service1Title": "Machine Learning Development",
    "service1Desc": "I specialize in developing machine learning solutions that turn raw data into actionable insights. Whether you need predictive models, recommendation systems, or automation, I can help design, train, and optimize ML models tailored to your needs.",
    "service1Cta": "🚀 Let’s build something intelligent together.",
    "service2Title": "Data Engineering",
    "service2Desc": "I develop and manage robust and scalable data pipelines, ensuring efficient and reliable data collection, processing, and availability to support analytics and machine learning applications.",
    "service2Cta": "🔧 Let's build your data infrastructure!",
    "service3Title": "Machine Learning Engineering",
    "service3Desc": "I design, build, and deploy end-to-end Machine Learning systems, handling everything from model conception to monitoring and maintenance in production environments, ensuring performance and scalability.",
    "service3Cta": "💡 Ready to take your ML models to production?",
    "service4Title": "Computational Social Science",
    "service4Desc": "I use data and computational tools to understand social structures and behaviors. Focusing on a critical and social perspective, I apply technologies like AI to analyze social phenomena and promote reflections on their use and ethical implications, transforming data into an understanding of social reality.",
    "service4Cta": "🌍 Let's understand and transform society with data?",
    "servicesCta": "Let's chat",
    "testimonialsTitle": "“Kim combines empathy and technical excellence through code and data to solve problems and tackle complex challenges with innovative solutions.”",
    "testimonial1Quote": "\"We were able to share several projects and great experiences. I admire her analytical skills, enthusiasm and dedication.\"",
    "testimonial1Name": "Gica Alves",
    "testimonial1Role": "Data Analyst, Itaú Bank",
    "testimonial2Quote": "\"I'm working with her for a year now. Among all the team members, she always stood out as the most hard-working, delivering projects before the deadline. In addition, she demonstrated proficiency in areas of advanced knowledge, which contributed to raising the quality of the final project.\"",
    "testimonial2Name": "Iago Aragão",
    "testimonial2Role": "CEO, Galliani Ltda.",
    "testimonial3Quote": "\"We have worked together on AI and Machine Learning projects, and I have always been impressed by her hard work, curiosity and ability to learn everything very quickly. She is always willing to look for creative solutions, works very well in a team and is always open to new challenges. In addition, she is super organized and committed! I am sure she will make a difference in any project or IT team!\"",
    "testimonial3Name": "Amanda Medeiros",
    "testimonial3Role": "Machine Learning Researcher, Federal University of Piauí",
    "portfolioTitle": "My Portfolio",
    "contactTitle": "Tell me about your project",
    "contactDesc1": "Every project has a problem to solve. If you have a challenge, I can code the solution.",
    "contactDesc2": "After you reach out, I’ll respond within 2-3 business days with either an initial project estimate or follow-up questions to understand your needs better.",
    "contactButton": "Get in touch",
    "designBy": "Design by",
    "connectWithMe": "let's connect",
    "emailContact": "Email",
    "copyright": "&copy; Created with 💻 and ☕ by: CodeOnTheSpectrum | 2025"
  }
}
